def number_to_words(n):
    words = {
        1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять",
        6: "шесть", 7: "семь", 8: "восемь", 9: "девять",
        10: "десять", 11: "одиннадцать", 12: "двенадцать", 13: "тринадцать",
        14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать",
        17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать",
        20: "двадцать", 30: "тридцать", 40: "сорок", 
        50: "пятьдесят", 60: "шестьдесят", 70: "семьдесят",
        80: "восемьдесят", 90: "девяносто", 100: "сто", 
        200: "двести", 300: "тристо", 400: "четыреста", 
        500: "пятьсот", 600: "шестьсот", 700: "семьсот", 
        800: "восемьсот", 900: "девятьсот"
    }

    if n == 1000:
        return "одна тысяча"

    q = n % 100
    w = q % 10
    
    return f"{words[(n // 100) * 100] if n >= 100 else ''} {words[(q // 10) * 10] if q >= 20 else ''} {words[w] if w > 0 else ''}".replace('  ', ' ')


input_number = int(input("Введите число от 1 до 1000: "))
print(number_to_words(input_number))
